k6/orders-test-resultados-50.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/orders-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 002/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 002/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 003/100 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   8% ] 003/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 004/100 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 004/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 005/100 VUs, 13 complete and 0 interrupted iterations
default   [  12% ] 005/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 005/100 VUs, 18 complete and 0 interrupted iterations
default   [  13% ] 005/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 006/100 VUs, 23 complete and 0 interrupted iterations
default   [  15% ] 006/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 006/100 VUs, 29 complete and 0 interrupted iterations
default   [  17% ] 006/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 007/100 VUs, 35 complete and 0 interrupted iterations
default   [  18% ] 007/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 008/100 VUs, 42 complete and 0 interrupted iterations
default   [  20% ] 008/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 008/100 VUs, 50 complete and 0 interrupted iterations
default   [  22% ] 008/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 009/100 VUs, 58 complete and 0 interrupted iterations
default   [  23% ] 009/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 009/100 VUs, 67 complete and 0 interrupted iterations
default   [  25% ] 009/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 012/100 VUs, 76 complete and 0 interrupted iterations
default   [  27% ] 012/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 015/100 VUs, 88 complete and 0 interrupted iterations
default   [  28% ] 015/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 017/100 VUs, 103 complete and 0 interrupted iterations
default   [  30% ] 017/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 020/100 VUs, 120 complete and 0 interrupted iterations
default   [  32% ] 020/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 023/100 VUs, 140 complete and 0 interrupted iterations
default   [  33% ] 023/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 025/100 VUs, 161 complete and 0 interrupted iterations
default   [  35% ] 025/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 028/100 VUs, 184 complete and 0 interrupted iterations
default   [  37% ] 028/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 031/100 VUs, 212 complete and 0 interrupted iterations
default   [  38% ] 031/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 033/100 VUs, 243 complete and 0 interrupted iterations
default   [  40% ] 033/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 036/100 VUs, 275 complete and 0 interrupted iterations
default   [  42% ] 036/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 039/100 VUs, 310 complete and 0 interrupted iterations
default   [  43% ] 039/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 041/100 VUs, 348 complete and 0 interrupted iterations
default   [  45% ] 041/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 044/100 VUs, 389 complete and 0 interrupted iterations
default   [  47% ] 044/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 047/100 VUs, 431 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 049/100 VUs, 478 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 053/100 VUs, 527 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 056/100 VUs, 577 complete and 0 interrupted iterations
default   [  53% ] 056/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 059/100 VUs, 619 complete and 0 interrupted iterations
default   [  55% ] 059/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 063/100 VUs, 671 complete and 0 interrupted iterations
default   [  57% ] 063/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 066/100 VUs, 722 complete and 0 interrupted iterations
default   [  58% ] 066/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 069/100 VUs, 778 complete and 0 interrupted iterations
default   [  60% ] 069/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 073/100 VUs, 833 complete and 0 interrupted iterations
default   [  62% ] 073/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 076/100 VUs, 881 complete and 0 interrupted iterations
default   [  63% ] 076/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 079/100 VUs, 927 complete and 0 interrupted iterations
default   [  65% ] 079/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 083/100 VUs, 995 complete and 0 interrupted iterations
default   [  67% ] 083/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 086/100 VUs, 1061 complete and 0 interrupted iterations
default   [  68% ] 086/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 089/100 VUs, 1113 complete and 0 interrupted iterations
default   [  70% ] 089/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 093/100 VUs, 1163 complete and 0 interrupted iterations
default   [  72% ] 093/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 096/100 VUs, 1201 complete and 0 interrupted iterations
default   [  73% ] 096/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 099/100 VUs, 1261 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 098/100 VUs, 1310 complete and 0 interrupted iterations
default   [  77% ] 098/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 094/100 VUs, 1351 complete and 0 interrupted iterations
default   [  78% ] 094/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 087/100 VUs, 1401 complete and 0 interrupted iterations
default   [  80% ] 087/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 080/100 VUs, 1450 complete and 0 interrupted iterations
default   [  82% ] 080/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 072/100 VUs, 1505 complete and 0 interrupted iterations
default   [  83% ] 072/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 063/100 VUs, 1563 complete and 0 interrupted iterations
default   [  85% ] 063/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 057/100 VUs, 1613 complete and 0 interrupted iterations
default   [  87% ] 057/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 051/100 VUs, 1665 complete and 0 interrupted iterations
default   [  88% ] 051/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 046/100 VUs, 1714 complete and 0 interrupted iterations
default   [  90% ] 046/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 037/100 VUs, 1760 complete and 0 interrupted iterations
default   [  92% ] 037/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 031/100 VUs, 1795 complete and 0 interrupted iterations
default   [  93% ] 031/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 024/100 VUs, 1826 complete and 0 interrupted iterations
default   [  95% ] 024/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 018/100 VUs, 1849 complete and 0 interrupted iterations
default   [  97% ] 018/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 009/100 VUs, 1867 complete and 0 interrupted iterations
default   [  98% ] 009/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 003/100 VUs, 1876 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration.......................................................: avg=307.51ms min=14.52ms med=47.2ms max=2.44s p(90)=936.9ms p(95)=1.23s
      { expected_response:true }............................................: avg=307.51ms min=14.52ms med=47.2ms max=2.44s p(90)=936.9ms p(95)=1.23s
    http_req_failed.........................................................: 0.00%  0 out of 1879
    http_reqs...............................................................: 1879   31.15823/s

    EXECUTION
    iteration_duration......................................................: avg=1.3s     min=1.01s   med=1.04s  max=3.44s p(90)=1.93s   p(95)=2.23s
    iterations..............................................................: 1879   31.15823/s
    vus.....................................................................: 3      min=1         max=99 
    vus_max.................................................................: 100    min=100       max=100

    NETWORK
    data_received...........................................................: 1.0 MB 17 kB/s
    data_sent...............................................................: 156 kB 2.6 kB/s



running (1m00.3s), 000/100 VUs, 1879 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m0s